docs/k6-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/stroke-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 8 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 8 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-03-31T15:46:02+05:30" level=info msg="Registration skipped (403). Logging in..." source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2026-03-31T15:46:03+05:30" level=info msg="Setup complete — room: SSKHNK" source=console

running (0m02.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 8 VUs  0m00.8s/1m0s

running (0m03.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 8 VUs  0m01.8s/1m0s

running (0m04.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 8 VUs  0m02.8s/1m0s

running (0m05.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 8 VUs  0m03.8s/1m0s

running (0m06.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 8 VUs  0m04.8s/1m0s

running (0m07.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 8 VUs  0m05.8s/1m0s

running (0m08.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 8 VUs  0m06.8s/1m0s

running (0m09.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 8 VUs  0m07.8s/1m0s

running (0m10.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 8 VUs  0m08.8s/1m0s

running (0m11.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 8 VUs  0m09.8s/1m0s

running (0m12.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 8 VUs  0m10.8s/1m0s

running (0m13.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 8 VUs  0m11.8s/1m0s

running (0m14.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  21% ] 8 VUs  0m12.8s/1m0s

running (0m15.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 8 VUs  0m13.8s/1m0s

running (0m16.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 8 VUs  0m14.8s/1m0s

running (0m17.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 8 VUs  0m15.8s/1m0s

running (0m18.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 8 VUs  0m16.8s/1m0s

running (0m19.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 8 VUs  0m17.8s/1m0s

running (0m20.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 8 VUs  0m18.8s/1m0s

running (0m21.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 8 VUs  0m19.8s/1m0s

running (0m22.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 8 VUs  0m20.8s/1m0s

running (0m23.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 8 VUs  0m21.8s/1m0s

running (0m24.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 8 VUs  0m22.8s/1m0s

running (0m25.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 8 VUs  0m23.8s/1m0s

running (0m26.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  41% ] 8 VUs  0m24.8s/1m0s

running (0m27.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 8 VUs  0m25.8s/1m0s

running (0m28.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 8 VUs  0m26.8s/1m0s

running (0m29.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 8 VUs  0m27.8s/1m0s

running (0m30.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  48% ] 8 VUs  0m28.8s/1m0s

running (0m31.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 8 VUs  0m29.8s/1m0s

running (0m32.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  51% ] 8 VUs  0m30.8s/1m0s

running (0m33.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 8 VUs  0m31.8s/1m0s

running (0m34.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  55% ] 8 VUs  0m32.8s/1m0s

running (0m35.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 8 VUs  0m33.8s/1m0s

running (0m36.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  58% ] 8 VUs  0m34.8s/1m0s

running (0m37.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 8 VUs  0m35.8s/1m0s

running (0m38.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  61% ] 8 VUs  0m36.8s/1m0s

running (0m39.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 8 VUs  0m37.8s/1m0s

running (0m40.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  65% ] 8 VUs  0m38.8s/1m0s

running (0m41.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  66% ] 8 VUs  0m39.8s/1m0s

running (0m42.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  68% ] 8 VUs  0m40.8s/1m0s

running (0m43.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 8 VUs  0m41.8s/1m0s

running (0m44.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  71% ] 8 VUs  0m42.8s/1m0s

running (0m45.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  73% ] 8 VUs  0m43.8s/1m0s

running (0m46.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  75% ] 8 VUs  0m44.8s/1m0s

running (0m47.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  76% ] 8 VUs  0m45.8s/1m0s

running (0m48.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  78% ] 8 VUs  0m46.8s/1m0s

running (0m49.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 8 VUs  0m47.8s/1m0s

running (0m50.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  81% ] 8 VUs  0m48.8s/1m0s

running (0m51.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  83% ] 8 VUs  0m49.8s/1m0s

running (0m52.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  85% ] 8 VUs  0m50.8s/1m0s

running (0m53.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  86% ] 8 VUs  0m51.8s/1m0s

running (0m54.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  88% ] 8 VUs  0m52.8s/1m0s

running (0m55.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 8 VUs  0m53.8s/1m0s

running (0m56.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  91% ] 8 VUs  0m54.8s/1m0s

running (0m57.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  93% ] 8 VUs  0m55.8s/1m0s

running (0m58.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  95% ] 8 VUs  0m56.8s/1m0s

running (0m59.0s), 8/8 VUs, 0 complete and 0 interrupted iterations
default   [  96% ] 8 VUs  0m57.8s/1m0s

running (1m00.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [  98% ] 8 VUs  0m58.8s/1m0s

running (1m01.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default   [ 100% ] 8 VUs  0m59.8s/1m0s

running (1m02.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m03.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m04.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m05.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m06.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m07.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m08.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m09.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m10.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m11.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m12.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m13.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m14.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m15.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m16.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m17.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m18.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m19.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m20.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m21.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m22.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m23.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m24.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m25.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m26.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m27.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m28.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m29.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m30.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s

running (1m31.0s), 8/8 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 8 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate < 0.01' rate=33.33%

    stroke_latency_ms
    ✓ 'p(99) < 200' p(99)=1

    ws_connect_errors
    ✓ 'count < 3' count=0


  █ TOTAL RESULTS 

    checks_total.......: 8       0.087734/s
    checks_succeeded...: 100.00% 8 out of 8
    checks_failed......: 0.00%   0 out of 8

    ✓ WS connected

    CUSTOM
    stroke_latency_ms..............: avg=0.202364 min=0        med=0        max=6        p(90)=1        p(95)=1       
    strokes_sent...................: 7190   78.850656/s

    HTTP
    http_req_duration..............: avg=391.16ms min=312.17ms med=425.68ms max=435.63ms p(90)=433.64ms p(95)=434.63ms
      { expected_response:true }...: avg=368.92ms min=312.17ms med=368.92ms max=425.68ms p(90)=414.32ms p(95)=420ms   
    http_req_failed................: 33.33% 1 out of 3
    http_reqs......................: 3      0.0329/s

    EXECUTION
    iteration_duration.............: avg=58.07s   min=58.07s   med=58.07s   max=58.07s   p(90)=58.07s   p(95)=58.07s  
    iterations.....................: 8      0.087734/s
    vus............................: 8      min=0        max=8
    vus_max........................: 8      min=8        max=8

    NETWORK
    data_received..................: 23 MB  247 kB/s
    data_sent......................: 2.2 MB 24 kB/s

    WEBSOCKET
    ws_connect_errors..............: 0      0/s
    ws_connecting..................: avg=25.69ms  min=16.59ms  med=26.98ms  max=34.22ms  p(90)=33.76ms  p(95)=33.94ms 
    ws_msgs_received...............: 57424  629.752445/s
    ws_msgs_sent...................: 7222   79.201591/s
    ws_session_duration............: avg=58.07s   min=58.07s   med=58.07s   max=58.07s   p(90)=58.07s   p(95)=58.07s  
    ws_sessions....................: 16     0.175467/s



running (1m31.2s), 0/8 VUs, 8 complete and 8 interrupted iterations
default ✓ [ 100% ] 8 VUs  1m0s
time="2026-03-31T15:47:33+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"